,>,>>>>>[-]+> // считываем 2 делимое и делитель/ резервируем 4 ячейчки для алгоритма с сайта/ и 2 ячейчас для if
<<<<<<[  //проверяем делитель на 0/ если не равен/ то используем алгоритм/ если равен/ то выдаем сообщение об ошибке
<[>>+ <<-]
>>[
 <[>>+ >+ <<<-]
 >>>[<<<+ >>>-]
 <[
  >+
  <<-[>>[-] >+ <<<-]    //он тут всюду
  >>>[<<<+ >>>-]
  <[
   <-
   [<<<- >>>[-]]+
  >-]
 <-]
 <<<+
>>]
<< .
>>>>>>-]>>>>>
[<[-]<[-]<[-]<[-]<[-]<[-]  //часть/ если делитель = 0/ обнуляем все ячейки/
++++++++++   //печатаем Error
[>+>+++>+++++++>++++++++++<<<<-]
>>++.>-.>++++++++++++++..---.+++.
>>->
]
